Revit 2021.1 API
IndependentTag.LeaderElbow Property
 The position of the elbow of the tag's leader.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
Syntax
C#
public XYZ LeaderElbow { get; set; }
Visual Basic
Public Property LeaderElbow As XYZ
	Get
	Set
Visual C++
public:
property XYZ^ LeaderElbow {
	XYZ^ get ();
	void set (XYZ^ value);
}
Remarks
 Straight leaders do not have elbow points.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was NULL
Autodesk.Revit.Exceptions.InvalidOperationException |  The tag does not have a leader or its leader is straight. -or- When setting this property: The tag does not have a leader.
See Also
IndependentTag Class
Autodesk.Revit.DB Namespace